Documents/РаспознанныйДокумент.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Document>
		<Properties>
			<Name>РаспознанныйДокумент</Name>
			<Posting>Deny</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ИдентификаторЗадания</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторРезультата</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.КонтрагентБРД</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ОрганизацияБРД</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Наименование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаДокумента</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипДокумента</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыДокументовРаспознаваниеДокументов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыСозданныхДокументовРаспознаваниеДокументов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИсходноеИзображение</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Миниатюра</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ШиринаИзображения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВысотаИзображения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяФайла</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>256</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОписаниеОшибки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Источник</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ИсточникиПолученияФайлов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Направление</Name>
					<Type>
						<v8:Type>cfg:EnumRef.НаправленияРаспознанногоДокумента</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОшибкаОтПользователя</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>Содержит текст ошибки от пользователя или информацию, которую он хочет передать разработчикам сервиса</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьИдентификаторИсточникаРаспознавания</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТребуетсяОплата</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МобильноеПриложение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.МобильныеПриложенияРаспознаванияДокументов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Отправитель</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>РеквизитыДокумента</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИмяРеквизита</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>40</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.РаспознаваемыеРеквизитыДокументаБРД</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗаполненоВручную</Name>
							<Comment>Значение было выбрано пользователем</Comment>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НайденноеЗначение</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.РаспознаваемыеРеквизитыДокументаБРД</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УверенностьНайденногоЗначения</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>3</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РаспознанныйТекст</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОбластьИзображения</Name>
							<Type>
								<v8:Type>v8:ValueStorage</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтрокВИзображении</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>3</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоординатаX0</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоординатаY0</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоординатаX1</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоординатаY1</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>РеквизитыТабличныхЧастей</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ТабличнаяЧасть</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>40</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерСтрокиТЧ</Name>
							<Comment>Это КлючСтроки. Всегда &gt; 0</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИмяРеквизита</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>40</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.РаспознаваемыеРеквизитыДокументаБРД</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗаполненоВручную</Name>
							<Comment>Значение было выбрано пользователем</Comment>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтрокаУдалена</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НайденноеЗначение</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.РаспознаваемыеРеквизитыДокументаБРД</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УверенностьНайденногоЗначения</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>3</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РаспознанныйТекст</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОбластьИзображения</Name>
							<Type>
								<v8:Type>v8:ValueStorage</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтрокВИзображении</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>3</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоординатаX0</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоординатаY0</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоординатаX1</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоординатаY1</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПорядокСтроки</Name>
							<Comment>Порядок строки на форме. Всегда &gt; 0</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/СвязанныеОбъектыРаспознаниеДокументов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<InformationRegister>
		<Properties>
			<Name>СвязанныеОбъектыРаспознаниеДокументов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>УдалитьРаспознанныйДокумент</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.РаспознанныйДокумент</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ОтображатьНаФорме</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПотенциальныйКандидат</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>СсылкаНаОбъект</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДокументыСоздаваемыеИзРаспознанногоДокументаБРД</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>РаспознанныйДокумент</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.РаспознанныйДокумент</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/НаправленияРаспознанногоДокумента.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Enum>
		<Properties>
			<Name>НаправленияРаспознанногоДокумента</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Входящий</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Исходящий</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/РаспознанныйДокумент/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт
	
	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЭтоАвторизованныйПользователь(Ответственный)
	|	ИЛИ ЗначениеРазрешено(Организация)";
	
КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция СоздатьРаспознанныйДокумент(ДанныеСервиса, ДанныеВыборки, РезультатыОбработки, ДатаСоздания = Неопределено, ДанныеСтраниц = Неопределено) Экспорт
	
	ДесериализованноеЗначение = ДанныеСервиса.ДесериализованноеЗначение.Получить("result");
	Если ТипЗнч(ДесериализованноеЗначение) <> Тип("Соответствие") Тогда
		Возврат Неопределено;
	КонецЕсли;
	Если ТипЗнч(ДесериализованноеЗначение.Получить("document")) = Тип("Соответствие") Тогда
		ТипДокумента = ДесериализованноеЗначение["document"].Получить("type");
	Иначе
		ТипДокумента = Неопределено;
	КонецЕсли;
	
	СоответствиеТипов = Новый Соответствие;
	СоответствиеТипов.Вставить("ACT", Перечисления.ТипыДокументовРаспознаваниеДокументов.АктОбОказанииУслуг);
	СоответствиеТипов.Вставить("SCH", Перечисления.ТипыДокументовРаспознаваниеДокументов.СчетНаОплату);
	СоответствиеТипов.Вставить("SF", Перечисления.ТипыДокументовРаспознаваниеДокументов.СчетФактура);
	СоответствиеТипов.Вставить("TG12", Перечисления.ТипыДокументовРаспознаваниеДокументов.ТОРГ12);
	СоответствиеТипов.Вставить("UPD", Перечисления.ТипыДокументовРаспознаваниеДокументов.УПД);
	
	РаспознаваниеДокументовПереопределяемый.ПриСопоставленииТиповДокументов(СоответствиеТипов);
	
	ТипСсылкой = СоответствиеТипов.Получить(ТипДокумента);
	Если ТипСсылкой = Неопределено Тогда
		ОписаниеОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = 'Идентификатор документа: %1
		|Неизвестный типа документа: ""%2""'"), ДанныеВыборки.ИдентификаторЗадания, ТипДокумента);
		СоздатьРаспознанныйДокументСОшибкой(ДанныеСервиса, ДанныеВыборки, РезультатыОбработки, ОписаниеОшибки, ДатаСоздания, ДанныеСтраниц);
		Возврат Неопределено;
	КонецЕсли;
	
	// Замер производительности
	РезультатОбратнойСвязи = РаспознаваниеДокументов.ОписаниеОбратнойСвязи("НачалоЗагрузки");
	Пакет = Новый Структура("created", РезультатОбратнойСвязи);
	РаспознаваниеДокументовКоннекторСлужебный.ПередатьОбратнуюСвязь(РезультатыОбработки.ИдентификаторРезультата, Пакет);
	
	СвойстваШапки = ДесериализованноеЗначение["Страница"];
	СоответствияШапки = СвойстваШапки["child"];
	
	НовыйДокумент = Документы.РаспознанныйДокумент.СоздатьДокумент();
	
	Если НЕ ДатаСоздания = Неопределено Тогда
		НовыйДокумент.Дата = ДатаСоздания;
	Иначе
		НовыйДокумент.Дата = ТекущаяУниверсальнаяДата();
	КонецЕсли;
	
	НовыйДокумент.ИдентификаторЗадания = ДанныеВыборки.ИдентификаторЗадания;
	НовыйДокумент.ИдентификаторРезультата = РезультатыОбработки.ИдентификаторРезультата;
	НовыйДокумент.ИмяФайла = РезультатыОбработки.ИменаФайлов;
	НовыйДокумент.ТипДокумента = ТипСсылкой;
	НовыйДокумент.Источник = Источник(РезультатыОбработки, ДанныеВыборки);
	НовыйДокумент.Направление = Перечисления.НаправленияРаспознанногоДокумента.Входящий;
	НовыйДокумент.Ответственный = РегистрыСведений.ИсходныеДанныеЗаданийРаспознаваниеДокументов.ПолучитьПользователяПоИдЗадания(
		НовыйДокумент.ИдентификаторЗадания
	);
	НовыйДокумент.МобильноеПриложение = РегистрыСведений.ИсходныеДанныеЗаданийРаспознаваниеДокументов.ПолучитьМобильноеПриложениеПоИдЗадания(
		НовыйДокумент.ИдентификаторЗадания
	);
	
	НовыйДокумент.ИсходноеИзображение = РаспознаваниеДокументовСериализацияСлужебный.ИзвлечьДанныеКартинки(
		СвойстваШапки["chunk_img"]
	);
	НовыйДокумент.Миниатюра = РаспознаваниеДокументовСериализацияСлужебный.ИзвлечьДанныеКартинки(
		СвойстваШапки["thumbnail"]
	);
	НовыйДокумент.ШиринаИзображения = РаспознаваниеДокументовСериализацияСлужебный.ПривестиТип(
		СвойстваШапки["width"],
		Тип("Число")
	);
	НовыйДокумент.ВысотаИзображения = РаспознаваниеДокументовСериализацияСлужебный.ПривестиТип(
		СвойстваШапки["height"],
		Тип("Число")
	);
	
	ТекСоответствие = РаспознаваниеДокументовСлужебный.ПолучитьСопоставлениеРеквизитовИСвойствJSON(НовыйДокумент.ТипДокумента);
	Для Каждого ДанныеСопоставления Из ТекСоответствие Цикл
		Если СтрНайти(ДанныеСопоставления.Адрес, ".Строка.") Тогда
			НоваяСтрока = НовыйДокумент.РеквизитыТабличныхЧастей.Добавить();
			НоваяСтрока.НомерСтрокиТЧ = 1;
			НоваяСтрока.ИмяРеквизита = ДанныеСопоставления.ИмяРеквизита;
			НоваяСтрока.Значение = ДанныеСопоставления.ОписаниеТипа.ПривестиЗначение();
		Иначе
			НоваяСтрока = НовыйДокумент.РеквизитыДокумента.Добавить();
			НоваяСтрока.ИмяРеквизита = ДанныеСопоставления.ИмяРеквизита;
			НоваяСтрока.Значение = ДанныеСопоставления.ОписаниеТипа.ПривестиЗначение();
		КонецЕсли;
	КонецЦикла;
	
	ЗаполнитьРеквизитыРекурсивно(СоответствияШапки, "", ТекСоответствие, НовыйДокумент);
	
	// Добавление строк с не распознанными колонками
	КопияТаблицы = НовыйДокумент.РеквизитыТабличныхЧастей.Выгрузить(, "НомерСтрокиТЧ");
	КопияТаблицы.Свернуть("НомерСтрокиТЧ");
	ВсеНомераСтрок = КопияТаблицы.ВыгрузитьКолонку("НомерСтрокиТЧ");
	
	Если ВсеНомераСтрок.Количество() = 0 Тогда
		ВызватьИсключение НСтр("ru = 'Ожидалось, что будет хотя бы одна строка.'");
	КонецЕсли;
	
	ВсеНомераСтрок.Удалить(ВсеНомераСтрок.Найти(1));
	
	Для Каждого ДанныеСопоставления Из ТекСоответствие Цикл
		Если СтрНайти(ДанныеСопоставления.Адрес, ".Строка.") Тогда
			Для Каждого НомерСтроки Из ВсеНомераСтрок Цикл
				Отбор = Новый Структура("НомерСтрокиТЧ, ИмяРеквизита", НомерСтроки, ДанныеСопоставления.ИмяРеквизита);
				Если НЕ НовыйДокумент.РеквизитыТабличныхЧастей.НайтиСтроки(Отбор).Количество() Тогда
					НоваяСтрока = НовыйДокумент.РеквизитыТабличныхЧастей.Добавить();
					НоваяСтрока.НомерСтрокиТЧ = НомерСтроки;
					НоваяСтрока.ИмяРеквизита = ДанныеСопоставления.ИмяРеквизита;
					НоваяСтрока.Значение = ДанныеСопоставления.ОписаниеТипа.ПривестиЗначение();
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
	КонецЦикла;
	
	НоваяСсылка = Документы.РаспознанныйДокумент.ПолучитьСсылку();
	НовыйДокумент.УстановитьСсылкуНового(НоваяСсылка);
	РаспознаваниеДокументов.ЗаполнитьСпискиВыбораНаСервере(НовыйДокумент, НоваяСсылка);
	ЗаполнитьЗначенияРаспознанногоДокумента(НовыйДокумент, НоваяСсылка);
	РезультатОбратнойСвязи = РаспознаваниеДокументов.ОписаниеОбратнойСвязи("Загружен");
	РаспознаваниеДокументовПереопределяемый.ПередЗаписьюРаспознанногоДокумента(НовыйДокумент, РезультатОбратнойСвязи);
	
	НовыйДокумент.Статус = Перечисления.СтатусыСозданныхДокументовРаспознаваниеДокументов.Новый;
	
	НовыйДокумент.ДополнительныеСвойства.Вставить("Автозаполнение", Истина);
	НовыйДокумент.ДополнительныеСвойства.Вставить("ДанныеСтраниц", ДанныеСтраниц);
	НовыйДокумент.Записать();
	
	ТекущиеНастройки = РегистрыСведений.ОбщиеНастройкиРаспознаваниеДокументов.ТекущиеНастройки();
	
	УстановитьПривилегированныйРежим(Истина);
	
	КандидатыВСвязанныеДокументы = РаспознаваниеДокументовСлужебный.НайтиПотенциальныеСвязаныеДокументы(НовыйДокумент);
	
	Для Каждого Кандидат Из КандидатыВСвязанныеДокументы Цикл
		
		Если ТекущиеНастройки.ПриОбнаруженииДокументаПрикреплятьИзображениеАвтоматически Тогда 
			
			АдресКартинки = ПоместитьВоВременноеХранилище(НовыйДокумент.ИсходноеИзображение.Получить());
			РаспознаваниеДокументовСлужебный.ДобавитьПрисоединенныйФайл(НовыйДокумент, Кандидат.Ссылка, АдресКартинки);
			УдалитьИзВременногоХранилища(АдресКартинки);
			
			РегистрыСведений.СвязанныеОбъектыРаспознаниеДокументов.ЗаписатьЗначения(Кандидат.Ссылка, НовыйДокумент.Ссылка, Ложь);
			
			РезультатОбратнойСвязи = РаспознаваниеДокументов.ОписаниеОбратнойСвязи("ПрикрепилСкан");
			Пакет = Новый Структура("created", РезультатОбратнойСвязи);
			РаспознаваниеДокументовКоннекторСлужебный.ПередатьОбратнуюСвязь(НовыйДокумент.ИдентификаторРезультата, Пакет);
			
			Если ТекущиеНастройки.ПомечатьДокументОбработаннымПриПрикреаленииИзображения Тогда
				НовыйДокумент.Статус = Перечисления.СтатусыСозданныхДокументовРаспознаваниеДокументов.Обработан;
				НовыйДокумент.Записать();
				
				РезультатОбратнойСвязи = РаспознаваниеДокументов.ОписаниеОбратнойСвязи("Проведен");
				Пакет = Новый Структура("created", РезультатОбратнойСвязи);
				РаспознаваниеДокументовКоннекторСлужебный.ПередатьОбратнуюСвязь(НовыйДокумент.ИдентификаторРезультата, Пакет);
			КонецЕсли;
			
		Иначе
			РегистрыСведений.СвязанныеОбъектыРаспознаниеДокументов.ЗаписатьЗначения(Кандидат.Ссылка, НовыйДокумент.Ссылка, Истина);
		КонецЕсли;
		
	КонецЦикла;
	
	УстановитьПривилегированныйРежим(Ложь);
	
	РезультатОбратнойСвязи.НомерРаспознанногоДокумента = НовыйДокумент.Номер;
	
	Пакет = Новый Структура("created", РезультатОбратнойСвязи);
	РаспознаваниеДокументовКоннекторСлужебный.ПередатьОбратнуюСвязь(НовыйДокумент.ИдентификаторРезультата, Пакет);
	
	РегистрыСведений.РезультатыОбработкиЗаданийРаспознаваниеДокументов.ЗаписатьРезультатОбработкиДокумента(
		ДанныеВыборки.ИдентификаторЗадания,
		РезультатыОбработки
	);
	
	Возврат НовыйДокумент.Ссылка;
	
КонецФункции

Функция СоздатьРаспознанныйДокументСОшибкой(ДанныеСервиса, ДанныеВыборки, РезультатыОбработки, ОписаниеОшибки = Неопределено, ДатаСоздания = Неопределено, ДанныеСтраниц = Неопределено) Экспорт
	
	// Замер производительности
	РезультатОбратнойСвязи = РаспознаваниеДокументов.ОписаниеОбратнойСвязи("НачалоЗагрузки");
	Пакет = Новый Структура("created", РезультатОбратнойСвязи);
	РаспознаваниеДокументовКоннекторСлужебный.ПередатьОбратнуюСвязь(РезультатыОбработки.ИдентификаторРезультата, Пакет);
	
	НовыйДокумент = Документы.РаспознанныйДокумент.СоздатьДокумент();
	Если НЕ ДатаСоздания = Неопределено Тогда
		НовыйДокумент.Дата = ДатаСоздания;
	Иначе
		НовыйДокумент.Дата = ТекущаяУниверсальнаяДата();
	КонецЕсли;
	
	НовыйДокумент.ИдентификаторЗадания = ДанныеВыборки.ИдентификаторЗадания;
	НовыйДокумент.ИдентификаторРезультата = РезультатыОбработки.ИдентификаторРезультата;
	НовыйДокумент.ИмяФайла = РезультатыОбработки.ИменаФайлов;
	НовыйДокумент.Источник = Источник(РезультатыОбработки, ДанныеВыборки);
	НовыйДокумент.Статус = Перечисления.СтатусыСозданныхДокументовРаспознаваниеДокументов.Ошибка;
	НовыйДокумент.Направление = Перечисления.НаправленияРаспознанногоДокумента.Входящий;
	НовыйДокумент.Ответственный = РегистрыСведений.ИсходныеДанныеЗаданийРаспознаваниеДокументов.ПолучитьПользователяПоИдЗадания(
		НовыйДокумент.ИдентификаторЗадания
	);
	НовыйДокумент.МобильноеПриложение = РегистрыСведений.ИсходныеДанныеЗаданийРаспознаваниеДокументов.ПолучитьМобильноеПриложениеПоИдЗадания(
		НовыйДокумент.ИдентификаторЗадания
	);
	
	ДесериализованноеЗначение = ДанныеСервиса.ДесериализованноеЗначение.Получить("result");
	Если ДесериализованноеЗначение <> Неопределено И ТипЗнч(ДесериализованноеЗначение) = Тип("Соответствие") Тогда
		Если ДесериализованноеЗначение.Получить("Страница") <> Неопределено Тогда
			// Если сервис умеет распознавать этот документ, но для него нет соответствия/обработчика
			// в данной конфигурации, то chunk_img (а не full_img) и thumbnail будут внутри элемента "Страница"
			ДесериализованноеЗначение = ДесериализованноеЗначение.Получить("Страница");
		КонецЕсли;
		
		Если ДесериализованноеЗначение.Получить("thumbnail") <> Неопределено Тогда
			НовыйДокумент.Миниатюра = РаспознаваниеДокументовСериализацияСлужебный.ИзвлечьДанныеКартинки(
				ДесериализованноеЗначение["thumbnail"]
			);
		КонецЕсли;
		
		Если ДесериализованноеЗначение.Получить("full_img") <> Неопределено Тогда
			НовыйДокумент.ИсходноеИзображение = РаспознаваниеДокументовСериализацияСлужебный.ИзвлечьДанныеКартинки(
				ДесериализованноеЗначение["full_img"]
			);
		ИначеЕсли ДесериализованноеЗначение.Получить("chunk_img") <> Неопределено Тогда
			НовыйДокумент.ИсходноеИзображение = РаспознаваниеДокументовСериализацияСлужебный.ИзвлечьДанныеКартинки(
				ДесериализованноеЗначение["chunk_img"]
			);
		КонецЕсли;
	КонецЕсли;
	
	Если ОписаниеОшибки <> Неопределено Тогда
		НовыйДокумент.ОписаниеОшибки = ОписаниеОшибки;
	ИначеЕсли ТипЗнч(ДесериализованноеЗначение) = Тип("Соответствие") Тогда
		НовыйДокумент.ОписаниеОшибки = РаспознаваниеДокументовКоннекторСлужебный.ТекстОшибкиПоКоду(ДесериализованноеЗначение.Получить("error"));
	ИначеЕсли ДесериализованноеЗначение <> Неопределено Тогда
		НовыйДокумент.ОписаниеОшибки = ДесериализованноеЗначение;
	КонецЕсли;
	
	Если ДесериализованноеЗначение.Получить("error") = 71 Тогда // Нет оплаты
		НовыйДокумент.ТребуетсяОплата = Истина;
	КонецЕсли;
	
	РаспознаваниеДокументовПереопределяемый.ПередЗаписьюРаспознанногоДокумента(НовыйДокумент);
	НовыйДокумент.ДополнительныеСвойства.Вставить("Автозаполнение", Истина);
	НовыйДокумент.ДополнительныеСвойства.Вставить("ДанныеСтраниц", ДанныеСтраниц);
	
	ДокументСсылка = Неопределено;
	НачатьТранзакцию();
	Попытка
		НовыйДокумент.Записать();
		РегистрыСведений.РезультатыОбработкиЗаданийРаспознаваниеДокументов.ЗаписатьРезультатОбработкиДокумента(
			ДанныеВыборки.ИдентификаторЗадания,
			РезультатыОбработки
		);
		ЗаписьЖурналаРегистрации(
			РаспознаваниеДокументов.СобытиеЖурналаРегистрации(),
			УровеньЖурналаРегистрации.Информация,
			Метаданные.Документы.РаспознанныйДокумент,
			НовыйДокумент.Ссылка,
			НСтр("ru = 'Записан документ с идентификатором:'") + Символы.ПС + РезультатыОбработки.ИдентификаторРезультата);
		ДокументСсылка = НовыйДокумент.Ссылка;
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		ЗаписьЖурналаРегистрации(
			РаспознаваниеДокументов.СобытиеЖурналаРегистрации(),
			УровеньЖурналаРегистрации.Ошибка, , ,
			НСтр("ru = 'Не удалось записать документ по причине:'") + Символы.ПС + ПодробноеПредставлениеОшибки(ИнформацияОбОшибке())
		);
		Возврат Неопределено;
	КонецПопытки;
	
	РезультатОбратнойСвязи = РаспознаваниеДокументов.ОписаниеОбратнойСвязи("Загружен");
	РезультатОбратнойСвязи.НомерРаспознанногоДокумента = НовыйДокумент.Номер;
	
	Пакет = Новый Структура("created", РезультатОбратнойСвязи);
	
	РаспознаваниеДокументовКоннекторСлужебный.ПередатьОбратнуюСвязь(НовыйДокумент.ИдентификаторРезультата, Пакет);
	
	Возврат ДокументСсылка;
	
КонецФункции

Процедура ЗаполнитьЗначенияРаспознанногоДокумента(ДокументОбъект, ДокументСсылка) Экспорт
	
	// Значения примитивных типов заполнены ранее. По ним не идет нечеткий поиск
	Для Каждого Реквизит Из ДокументОбъект.РеквизитыДокумента Цикл
		Если Реквизит.УверенностьНайденногоЗначения >= РаспознаваниеДокументовСлужебный.ГраницаПроблемныхЗначений()
			И НЕ РаспознаваниеДокументовКлиентСервер.ЭтоПримитивныйТип(ТипЗнч(Реквизит.Значение))
			И НЕ РаспознаваниеДокументовКлиентСервер.РаспознанныйТекстСодержитПустоеЗначениеПоля(Реквизит.ИмяРеквизита, Реквизит.РаспознанныйТекст) Тогда
			
			Реквизит.Значение = Реквизит.НайденноеЗначение;
		КонецЕсли;
	КонецЦикла;
	
	Для Каждого Реквизит Из ДокументОбъект.РеквизитыТабличныхЧастей Цикл
		Если Реквизит.УверенностьНайденногоЗначения >= РаспознаваниеДокументовСлужебный.ГраницаПроблемныхЗначений()
			И НЕ РаспознаваниеДокументовКлиентСервер.ЭтоПримитивныйТип(ТипЗнч(Реквизит.Значение))
			И НЕ РаспознаваниеДокументовКлиентСервер.РаспознанныйТекстСодержитПустоеЗначениеПоля(Реквизит.ИмяРеквизита, Реквизит.РаспознанныйТекст) Тогда
			
			Реквизит.Значение = Реквизит.НайденноеЗначение;
		КонецЕсли;
	КонецЦикла;
	
	РаспознаваниеДокументовПереопределяемый.ПриЗаполненииРаспознанногоДокумента(ДокументОбъект, ДокументСсылка);
	
КонецПроцедуры

Процедура ЗаполнитьРеквизитыРекурсивно(СоответствиеJSON, АдресJSON, СоответствиеРеквизитов, Док, ТабличнаяЧасть = Неопределено, НомерСтрокиТЧ = 0, Знач ПредСоответствиеJSON = Неопределено)
	
	Перем СтрТабРек;
	
	Для Каждого ТекСоотв Из СоответствиеJSON Цикл
		Если ТипЗнч(ТекСоотв.Значение) = Тип("Соответствие") Тогда
			Если ТекСоотв.Значение["type"] = "container" ИЛИ НЕ ТекСоотв.Значение.Получить("child") = Неопределено Тогда
				Если ТекСоотв.Значение.Получить("postprocessed") = Истина Тогда
					ЗаполнитьЗначенияРеквизита(СтрТабРек, АдресJSON + СокрЛП(ТекСоотв.Ключ) + ".", Док, НомерСтрокиТЧ, СоответствиеРеквизитов, ТабличнаяЧасть, ТекСоотв.Значение, СоответствиеJSON);
				КонецЕсли;
				НовСоответствие = ТекСоотв.Значение["child"];
				ПредСоответствиеJSON = ТекСоотв;
			ИначеЕсли ТекСоотв.Значение["type"] = "table" Тогда
				ДанныеСтрок = ТекСоотв.Значение["rows"];
				АдресJSON = ТекСоотв.Ключ + ".Строка.";
				ИмяТаблицы = ТекСоотв.Ключ;
				
				РаспознаваниеДокументовСлужебный.ПриФормированииДанныхТабличныхЧастей(Док, ИмяТаблицы, АдресJSON, ДанныеСтрок);
				
				Для Каждого СтрокаТаблицы Из ДанныеСтрок Цикл
					ЗаполнитьРеквизитыРекурсивно(СтрокаТаблицы, АдресJSON, СоответствиеРеквизитов, Док, ИмяТаблицы, ДанныеСтрок.Найти(СтрокаТаблицы) + 1);
				КонецЦикла;
				
				ДанныеПодвала = ТекСоотв.Значение["footer"];
				ИмяТаблицы = ТекСоотв.Ключ;
				
				РаспознаваниеДокументовСлужебный.ПриФормированииДанныхТабличныхЧастей(Док, ИмяТаблицы, АдресJSON, ДанныеСтрок);
				
				Для Каждого СтрокаТаблицы Из ДанныеПодвала Цикл
					АдресJSON = ИмяТаблицы + "." + СтрокаТаблицы.Ключ + ".";
					ЗаполнитьРеквизитыРекурсивно(СтрокаТаблицы.Значение, АдресJSON, СоответствиеРеквизитов, Док);
				КонецЦикла;
				
				АдресJSON = "";
				Продолжить;
			Иначе
				НовСоответствие = ТекСоотв.Значение;
			КонецЕсли;
			ЗаполнитьРеквизитыРекурсивно(НовСоответствие, АдресJSON + СокрЛП(ТекСоотв.Ключ) + ".", СоответствиеРеквизитов, Док, ТабличнаяЧасть, НомерСтрокиТЧ, ПредСоответствиеJSON);
		Иначе
			ЗаполнитьЗначенияРеквизита(СтрТабРек, АдресJSON, Док, НомерСтрокиТЧ, СоответствиеРеквизитов, ТабличнаяЧасть, СоответствиеJSON, ПредСоответствиеJSON);
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьЗначенияРеквизита(СтрТабРек, Знач АдресJSON, Знач Док, Знач НомерСтрокиТЧ, Знач СоответствиеРеквизитов, Знач ТабличнаяЧасть, Знач СоответствиеJSON, Знач ПредСоответствиеJSON = Неопределено)
	
	Если СтрТабРек <> Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТекАдрес = Лев(АдресJSON, СтрДлина(АдресJSON) - 1); // Убираем точку в конце
	СтрокиОтбора = СоответствиеРеквизитов.НайтиСтроки(Новый Структура("Адрес", ТекАдрес));
	Для Каждого ТекРеквизит Из СтрокиОтбора Цикл
		
		Если ТабличнаяЧасть = Неопределено Тогда
			Отбор = Новый Структура("ИмяРеквизита", ТекРеквизит.ИмяРеквизита);
			НайденныеСтроки = Док.РеквизитыДокумента.НайтиСтроки(Отбор);
			СтрТабРек = НайденныеСтроки[0];
		Иначе
			Если НомерСтрокиТЧ = 1 Тогда
				Отбор = Новый Структура("НомерСтрокиТЧ, ИмяРеквизита", 1, ТекРеквизит.ИмяРеквизита);
				СтрТабРек = Док.РеквизитыТабличныхЧастей.НайтиСтроки(Отбор)[0];
			Иначе
				СтрТабРек = Док.РеквизитыТабличныхЧастей.Добавить();
			КонецЕсли;
			СтрТабРек.НомерСтрокиТЧ = НомерСтрокиТЧ;
		КонецЕсли;
		
		СтрТабРек.ИмяРеквизита = ТекРеквизит.ИмяРеквизита;
		СтрТабРек.Значение = ТекРеквизит.ОписаниеТипа.ПривестиЗначение();
		
		Для Каждого ТекСоотв Из СоответствиеJSON Цикл
			Если ТипЗнч(ТекСоотв.Значение) = Тип("Соответствие") Тогда
				Продолжить;
			КонецЕсли;
			
			Если ТекСоотв.Ключ = "text" Тогда
				СтрТабРек.РаспознанныйТекст = ТекСоотв.Значение;
				ТекТипРеквизита = ТипЗнч(СтрТабРек.Значение);
				Если РаспознаваниеДокументовКлиентСервер.ЭтоПримитивныйТип(ТекТипРеквизита) Тогда
					Если ТекТипРеквизита = Тип("Строка") Тогда
						СтрТабРек.Значение = СокрЛП(ТекСоотв.Значение);
					Иначе
						СтрТабРек.Значение = РаспознаваниеДокументовСериализацияСлужебный.ПривестиТип(ТекСоотв.Значение, ТекТипРеквизита);
					КонецЕсли;
				КонецЕсли;
			ИначеЕсли ТекСоотв.Ключ = "chunk_img" Тогда
				Если ТекСоотв.Значение = Неопределено Тогда
					Если ПредСоответствиеJSON = Неопределено Или ПредСоответствиеJSON.Значение["chunk_img"] = Неопределено Тогда
						СтрТабРек.СтрокВИзображении = 0;
					Иначе 
						СтрТабРек.ОбластьИзображения = РаспознаваниеДокументовСериализацияСлужебный.ИзвлечьДанныеКартинки(
							ПредСоответствиеJSON.Значение["chunk_img"]
						);
					КонецЕсли;
				Иначе
					СтрТабРек.ОбластьИзображения = РаспознаваниеДокументовСериализацияСлужебный.ИзвлечьДанныеКартинки(
						ТекСоотв.Значение
					);
				КонецЕсли;
			ИначеЕсли ТекСоотв.Ключ = "num_lines" Тогда
				СтрТабРек.СтрокВИзображении = ТекСоотв.Значение;
			ИначеЕсли ТекСоотв.Ключ = "bbox" Тогда
				Если ТипЗнч(ТекСоотв.Значение) = Тип("Массив") И ТекСоотв.Значение.Количество() = 4 Тогда
					СтрТабРек.КоординатаX0 = ТекСоотв.Значение[0];
					СтрТабРек.КоординатаY0 = ТекСоотв.Значение[1];
					СтрТабРек.КоординатаX1 = ТекСоотв.Значение[2];
					СтрТабРек.КоординатаY1 = ТекСоотв.Значение[3];
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры

Функция Источник(РезультатыОбработки, ДанныеВыборки)
	
	Если РезультатыОбработки.Свойство("Источник") Тогда 
		Возврат Перечисления.ИсточникиПолученияФайлов.ВнешняяСистема;
	Иначе
		Возврат РегистрыСведений.ПредставлениеЗаданийРаспознаваниеДокументов.ИсточникПоИдентификатору(
			ДанныеВыборки.ИдентификаторЗадания
		);
	КонецЕсли;
	
КонецФункции

Процедура ПерезаписатьДокументыСозданныеМобильнымПриложением(МобильноеПриложение) Экспорт
	
	НачатьТранзакцию();
	Попытка
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	РаспознанныйДокумент.Ссылка КАК Ссылка
			|ИЗ
			|	Документ.РаспознанныйДокумент КАК РаспознанныйДокумент
			|ГДЕ
			|	РаспознанныйДокумент.МобильноеПриложение = &МобильноеПриложение";
		
		Запрос.УстановитьПараметр("МобильноеПриложение", МобильноеПриложение);
		
		РезультатЗапроса = Запрос.Выполнить();
		Выборка = РезультатЗапроса.Выбрать();
		
		Пока Выборка.Следующий() Цикл
			
			Объект = Выборка.Ссылка.ПолучитьОбъект();
			Объект.Записать();
			
		КонецЦикла;
		
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
	КонецПопытки;
	
КонецПроцедуры

Функция СоздатьРаспознанныйДокументСОшибкойЗагрузки(
		ИдентификаторЗадания,
		ОписаниеОшибки,
		РезультатыОбработки = Неопределено
	) Экспорт
	
	Если РезультатыОбработки = Неопределено Тогда 
		
		РезультатыОбработки = РегистрыСведений.ИсходныеДанныеЗаданийРаспознаваниеДокументов
			.ПолучитьРезультатыОбработкиПоИдЗадания(ИдентификаторЗадания);
		
	КонецЕсли;
	
	НовыйДокумент = Документы.РаспознанныйДокумент.СоздатьДокумент();
	НовыйДокумент.Дата = ТекущаяУниверсальнаяДата();
	НовыйДокумент.ИдентификаторЗадания = ИдентификаторЗадания;
	НовыйДокумент.ИдентификаторРезультата = РезультатыОбработки.ИдентификаторРезультата;
	НовыйДокумент.ИмяФайла = РезультатыОбработки.ИменаФайлов;
	НовыйДокумент.Наименование = РезультатыОбработки.ИменаФайлов;
	НовыйДокумент.Источник = РегистрыСведений.ПредставлениеЗаданийРаспознаваниеДокументов
		.ИсточникПоИдентификатору(
			ИдентификаторЗадания
		);
	НовыйДокумент.Статус = Перечисления.СтатусыСозданныхДокументовРаспознаваниеДокументов.Ошибка;
	НовыйДокумент.Направление = Перечисления.НаправленияРаспознанногоДокумента.Входящий;
	НовыйДокумент.Ответственный = РегистрыСведений.ИсходныеДанныеЗаданийРаспознаваниеДокументов
		.ПолучитьПользователяПоИдЗадания(
			НовыйДокумент.ИдентификаторЗадания
		);
	НовыйДокумент.МобильноеПриложение = РегистрыСведений.ИсходныеДанныеЗаданийРаспознаваниеДокументов
		.ПолучитьМобильноеПриложениеПоИдЗадания(
			НовыйДокумент.ИдентификаторЗадания
		);
	НовыйДокумент.ОписаниеОшибки = ОписаниеОшибки;
	НовыйДокумент.Записать();
	
	РегистрыСведений.РезультатыОбработкиЗаданийРаспознаваниеДокументов
		.ЗаписатьРезультатОбработкиДокумента(
			ИдентификаторЗадания,
			РезультатыОбработки
		);
	
КонецФункции

#КонецОбласти

#КонецЕсли
